```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_kubernetes_cluster.aks[0m will be created
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster" "aks" {
      [32m+[0m[0m current_kubernetes_version          = (known after apply)
      [32m+[0m[0m dns_prefix                          = "mngcluster"
      [32m+[0m[0m fqdn                                = (known after apply)
      [32m+[0m[0m http_application_routing_zone_name  = (known after apply)
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m kube_admin_config                   = (sensitive value)
      [32m+[0m[0m kube_admin_config_raw               = (sensitive value)
      [32m+[0m[0m kube_config                         = (sensitive value)
      [32m+[0m[0m kube_config_raw                     = (sensitive value)
      [32m+[0m[0m kubernetes_version                  = "1.30"
      [32m+[0m[0m location                            = "eastus"
      [32m+[0m[0m name                                = "cluster-manager"
      [32m+[0m[0m node_os_upgrade_channel             = "NodeImage"
      [32m+[0m[0m node_resource_group                 = (known after apply)
      [32m+[0m[0m node_resource_group_id              = (known after apply)
      [32m+[0m[0m oidc_issuer_url                     = (known after apply)
      [32m+[0m[0m portal_fqdn                         = (known after apply)
      [32m+[0m[0m private_cluster_enabled             = false
      [32m+[0m[0m private_cluster_public_fqdn_enabled = false
      [32m+[0m[0m private_dns_zone_id                 = (known after apply)
      [32m+[0m[0m private_fqdn                        = (known after apply)
      [32m+[0m[0m resource_group_name                 = "infra-cluster-manager"
      [32m+[0m[0m role_based_access_control_enabled   = true
      [32m+[0m[0m run_command_enabled                 = true
      [32m+[0m[0m sku_tier                            = "Free"
      [32m+[0m[0m support_plan                        = "KubernetesOfficial"
      [32m+[0m[0m tags                                = {
          [32m+[0m[0m "environment" = "development"
          [32m+[0m[0m "owner"       = "devops-team"
          [32m+[0m[0m "project"     = "platform-engineering"
        }
      [32m+[0m[0m workload_identity_enabled           = false

      [32m+[0m[0m default_node_pool {
          [32m+[0m[0m auto_scaling_enabled = false
          [32m+[0m[0m kubelet_disk_type    = (known after apply)
          [32m+[0m[0m max_pods             = (known after apply)
          [32m+[0m[0m name                 = "admnodes"
          [32m+[0m[0m node_count           = 1
          [32m+[0m[0m node_labels          = (known after apply)
          [32m+[0m[0m orchestrator_version = (known after apply)
          [32m+[0m[0m os_disk_size_gb      = (known after apply)
          [32m+[0m[0m os_disk_type         = "Managed"
          [32m+[0m[0m os_sku               = (known after apply)
          [32m+[0m[0m scale_down_mode      = "Delete"
          [32m+[0m[0m type                 = "VirtualMachineScaleSets"
          [32m+[0m[0m ultra_ssd_enabled    = false
          [32m+[0m[0m vm_size              = "Standard_D2ps_v5"
          [32m+[0m[0m vnet_subnet_id       = (known after apply)
          [32m+[0m[0m workload_runtime     = (known after apply)
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_profile {
          [32m+[0m[0m dns_service_ip     = "10.0.0.10"
          [32m+[0m[0m ip_versions        = (known after apply)
          [32m+[0m[0m load_balancer_sku  = "standard"
          [32m+[0m[0m network_data_plane = "azure"
          [32m+[0m[0m network_mode       = (known after apply)
          [32m+[0m[0m network_plugin     = "kubenet"
          [32m+[0m[0m network_policy     = (known after apply)
          [32m+[0m[0m outbound_type      = "loadBalancer"
          [32m+[0m[0m pod_cidr           = "10.244.0.0/16"
          [32m+[0m[0m pod_cidrs          = (known after apply)
          [32m+[0m[0m service_cidr       = "10.0.0.0/16"
          [32m+[0m[0m service_cidrs      = (known after apply)
        }
    }

[1m  # azurerm_kubernetes_cluster_node_pool.app_node_pool[0m will be created
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster_node_pool" "app_node_pool" {
      [32m+[0m[0m auto_scaling_enabled  = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m kubelet_disk_type     = (known after apply)
      [32m+[0m[0m kubernetes_cluster_id = (known after apply)
      [32m+[0m[0m max_count             = 2
      [32m+[0m[0m max_pods              = (known after apply)
      [32m+[0m[0m min_count             = 1
      [32m+[0m[0m mode                  = "User"
      [32m+[0m[0m name                  = "appnodes"
      [32m+[0m[0m node_count            = 1
      [32m+[0m[0m node_labels           = (known after apply)
      [32m+[0m[0m orchestrator_version  = (known after apply)
      [32m+[0m[0m os_disk_size_gb       = (known after apply)
      [32m+[0m[0m os_disk_type          = "Managed"
      [32m+[0m[0m os_sku                = (known after apply)
      [32m+[0m[0m os_type               = "Linux"
      [32m+[0m[0m priority              = "Regular"
      [32m+[0m[0m scale_down_mode       = "Delete"
      [32m+[0m[0m spot_max_price        = -1
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "environment" = "development"
          [32m+[0m[0m "owner"       = "devops-team"
          [32m+[0m[0m "project"     = "platform-engineering"
        }
      [32m+[0m[0m ultra_ssd_enabled     = false
      [32m+[0m[0m vm_size               = "Standard_D2ps_v5"
      [32m+[0m[0m vnet_subnet_id        = (known after apply)
    }

[1m  # azurerm_network_security_group.aks_nsg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "aks_nsg" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "eastus"
      [32m+[0m[0m name                = "aks-nsg"
      [32m+[0m[0m resource_group_name = "infra-cluster-manager"
      [32m+[0m[0m security_rule       = [
          [32m+[0m[0m {
              [32m+[0m[0m access                                     = "Allow"
              [32m+[0m[0m description                                = ""
              [32m+[0m[0m destination_address_prefix                 = "*"
              [32m+[0m[0m destination_address_prefixes               = []
              [32m+[0m[0m destination_application_security_group_ids = []
              [32m+[0m[0m destination_port_range                     = "443"
              [32m+[0m[0m destination_port_ranges                    = []
              [32m+[0m[0m direction                                  = "Inbound"
              [32m+[0m[0m name                                       = "Allow-HTTPS"
              [32m+[0m[0m priority                                   = 1001
              [32m+[0m[0m protocol                                   = "Tcp"
              [32m+[0m[0m source_address_prefix                      = "*"
              [32m+[0m[0m source_address_prefixes                    = []
              [32m+[0m[0m source_application_security_group_ids      = []
              [32m+[0m[0m source_port_range                          = "*"
              [32m+[0m[0m source_port_ranges                         = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m access                                     = "Allow"
              [32m+[0m[0m description                                = ""
              [32m+[0m[0m destination_address_prefix                 = "*"
              [32m+[0m[0m destination_address_prefixes               = []
              [32m+[0m[0m destination_application_security_group_ids = []
              [32m+[0m[0m destination_port_range                     = "80"
              [32m+[0m[0m destination_port_ranges                    = []
              [32m+[0m[0m direction                                  = "Inbound"
              [32m+[0m[0m name                                       = "Allow-HTTP"
              [32m+[0m[0m priority                                   = 1000
              [32m+[0m[0m protocol                                   = "Tcp"
              [32m+[0m[0m source_address_prefix                      = "*"
              [32m+[0m[0m source_address_prefixes                    = []
              [32m+[0m[0m source_application_security_group_ids      = []
              [32m+[0m[0m source_port_range                          = "*"
              [32m+[0m[0m source_port_ranges                         = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m access                                     = "Deny"
              [32m+[0m[0m description                                = ""
              [32m+[0m[0m destination_address_prefix                 = "*"
              [32m+[0m[0m destination_address_prefixes               = []
              [32m+[0m[0m destination_application_security_group_ids = []
              [32m+[0m[0m destination_port_range                     = "*"
              [32m+[0m[0m destination_port_ranges                    = []
              [32m+[0m[0m direction                                  = "Inbound"
              [32m+[0m[0m name                                       = "Deny-All"
              [32m+[0m[0m priority                                   = 4096
              [32m+[0m[0m protocol                                   = "*"
              [32m+[0m[0m source_address_prefix                      = "*"
              [32m+[0m[0m source_address_prefixes                    = []
              [32m+[0m[0m source_application_security_group_ids      = []
              [32m+[0m[0m source_port_range                          = "*"
              [32m+[0m[0m source_port_ranges                         = []
            },
        ]
    }

[1m  # azurerm_resource_group.cluster_manager[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "cluster_manager" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "eastus"
      [32m+[0m[0m name     = "infra-cluster-manager"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "environment" = "development"
          [32m+[0m[0m "owner"       = "devops-team"
          [32m+[0m[0m "project"     = "platform-engineering"
        }
    }

[1m  # azurerm_subnet.aks_subnet[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet" "aks_subnet" {
      [32m+[0m[0m address_prefixes                              = [
          [32m+[0m[0m "10.30.1.0/24",
        ]
      [32m+[0m[0m default_outbound_access_enabled               = true
      [32m+[0m[0m id                                            = (known after apply)
      [32m+[0m[0m name                                          = "aks-subnet"
      [32m+[0m[0m private_endpoint_network_policies             = "Disabled"
      [32m+[0m[0m private_link_service_network_policies_enabled = true
      [32m+[0m[0m resource_group_name                           = "infra-cluster-manager"
      [32m+[0m[0m virtual_network_name                          = "main-vnet"
    }

[1m  # azurerm_subnet_network_security_group_association.aks_subnet_nsg_association[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_network_security_group_association" "aks_subnet_nsg_association" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m network_security_group_id = (known after apply)
      [32m+[0m[0m subnet_id                 = (known after apply)
    }

[1m  # azurerm_virtual_network.vnet[0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "vnet" {
      [32m+[0m[0m address_space       = [
          [32m+[0m[0m "10.30.0.0/16",
        ]
      [32m+[0m[0m dns_servers         = (known after apply)
      [32m+[0m[0m guid                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "eastus"
      [32m+[0m[0m name                = "main-vnet"
      [32m+[0m[0m resource_group_name = "infra-cluster-manager"
      [32m+[0m[0m subnet              = (known after apply)
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "environment" = "development"
          [32m+[0m[0m "owner"       = "devops-team"
          [32m+[0m[0m "project"     = "platform-engineering"
        }
    }

[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m aks_api_server_url     = (sensitive value)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
<!-- Sticky Pull Request CommentTerraform Plan -->